Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/alternative_repayment_arrangements.html.txt.tmx
Source language: en
Languages: ga

source: Alternative repayment arrangements for people in mortgage difficulty
ga: Socruithe malartacha aisíocaíochta do dhaoine a bhfuil deacracht mhorgáiste acu

source: If you are having difficulty paying your mortgage, your lender may offer you an alternative repayment arrangement - often called a mortgage restructure
ga: Má tá deacrachtaí agat do mhorgáiste a íoc, féadfaidh d’iasachtóir socrú malartach aisíocaíochta a chur ar tairiscint duit – tugtar athstruchtúrú morgáiste air go minic

source: This document is concerned with a mortgage on your home (your primary residence) – not a buy-to-let property
ga: Baineann an cháipéis seo le morgáiste ar do theach (do phríomháit chónaithe) – seachas réadmhaoin a cheannaítear lena ligean

source: It outlines some of the alternative repayment arrangements that may be offered to you and issues that you should consider
ga: Tugtar cuntas ann ar chuid de na socruithe malartacha aisíocaiochta a d’fhéadfaí a chur ar tairiscint duit agus na saincheisteanna ar cheart duit machnamh a dhéanamh orthu

source: The arrangements available from your lender may be part of the Mortgage Arrears Resolution Process (MARP) or outside it. They may vary as the market continues to evolve and change
ga: D’fhéadfadh na socruithe atá ar fáil ó d’iasachtóir bheith mar chuid den Phróiseas Réitigh Riaráistí Morgáiste (PPRM) nó lasmuigh de agus d’fhéadfaidís athrú de réir mar a leanann an margadh ag teacht chun cinn nó ag athrú

source: Every case is different and your lender is obliged to look carefully at your personal circumstances before deciding what option to offer you
ga: Tá gach cás difriúil agus tá dualgas ar d’iasachtóir féachaint go cúramach ar do chúinsí pearsanta sula ndéanann siad cinneadh ar cén rogha a chuirfidh siad ar tairiscint duit

source: Having assessed your financial situation, your lender will have chosen an alternative repayment arrangement that it considers appropriate and sustainable for your circumstances
ga: Tar éis measúnú a dhéanamh ar do chás airgeadais, beidh d’iasachtóir tar éis socrú malartach aisíocaíochta a roghnú a mheasann siad atá oiriúnach agus inmharthana i dtaobh do chuid cúinsí

source: However, it is important that you also think carefully about the offer and whether it is sustainable in the long term from your point of view
ga: Is tábhachtach, áfach, go ndéanann tú machnamh cúramach ar an tairiscint agus ar cibé acu an bhfuil nó nach bhfuil sí inmharthana san fhadtéarma i dtaobh do dhearcaidh féin

source: You will be signing a new mortgage contract and will be bound by its terms for the duration of the agreement
ga: Beidh conradh nua morgáiste á shíniú agat agus beidh tú faoi cheanglas a théarmaí d’fhad an chomhaontaithe

source: Make sure that you fully understand the details of the offer
ga: Cinntigh go dtuigeann tú go hiomlán sonraí na tairisceana

source: You can use the MABS jargon buster to check the meaning of financial terms
ga: Féadfaidh tú scriostóir béarlagair an SBCA a úsáid chun brí théarmaí airgeadais a sheiceáil

source: You need to look at 2 things in particular – affordability and sustainability
ga: Is gá duit súil a chaitheamh ar 2 rud, ach go háirithe – inacmhainneacht agus inmharthanacht

source: As part of the Mortgage Arrears Resolution Process (MARP) you will have completed a Standard Financial Statement (pdf) for your lender
ga: Mar chuid den Phróiseas Réitigh Riaráistí Morgáiste (PRRM), beidh Ráiteas Caighdeánach Airgeadais (pdf) comhlánaithe agat do d’iasachtóir

source: You can use this to review your income and outgoings
ga: Féadfaidh tú seo a úsáid chun athbhreithniú a dhéanamh ar d’ioncam agus d’eisíocaíochtaí

source: When assessing whether you can afford the proposed repayments, things you should consider include:
ga: Nuair a dhéanann tú measúnú ar cibé acu an féidir nó nach féidir leat íoc as na haisíocaíochtaí a bheartaítear, seo a leanas na rudaí ar cheart duit breithniú a dhéanamh orthu:

source: • Your current net monthly income
ga: • Do ghlanioncam reatha míosúil

source: • All your current monthly outgoings
ga: • D’eisíocaíochtaí reatha míosúla go léir

source: • The net disposable income that you will have left to pay the mortgage
ga: • An glanioncam indiúscartha a bheidh fágtha agat chun an morgáiste a íoc

source: • How much your assets are worth
ga: • An méid is fiú do chuid sócmhainní

source: • Any other debts you may have
ga: • Aon fhiachais eile a d’fhéadfadh bheith agat

source: • If the alternative repayment arrangement offered is a short-term one, whether you will be able to pay the higher repayments when the arrangement ends
ga: • Más socrú gearrthéarmach an socrú malartach aisíocaíochta atá agat, cibé acu an mbeidh nó nach mbeidh tú in ann na haisíocaíochtaí níos airde a íoc nuair a thiocfaidh deireadh leis an socrú

source: Tools to help you
ga: Uirlisí a chabhróidh leat

source: • Most lenders have family finance budgeting tools on their websites
ga: • Tá uirlisí buiséadta airgeadas teaghlaigh ag formhór na n-iasachtóirí ar a láithreáin ghréasáin

source: • Consumerhelp.ie has several useful budgeting calculators
ga: • Tá roinnt áireamháin bhuiséadta áisiúla ar consumerhelp.ie

source: • Mabs.ie also has a budgeting tool
ga: • Tá uirlis bhuiséadta ar mabs.ie chomh maith

source: • The Insolvency Service of Ireland (ISI) calculator of reasonable living expenses may also be useful
ga: • Chomh maith leis sin, d’fhéadfadh áireamhán costais réasúnta mhaireachtála Sheirbhís Dócmhainneachta na hÉireann (SDÉ) bheith áisiúil

source: • The ISI’s website backontrack.ie has information for people in financial difficulty
ga: • Tá faisnéis ar láithreán gréasáin SDÉ, backontrack.ie, do dhaoine a bhfuil deacracht airgeadais acu

source: To assess whether you can keep up payments for the remaining term of the mortgage, you need to consider what may change in your personal situation and whether future external changes may affect your ability to repay
ga: Lena mheasúnú cibé acu an féidir nó nach féidir leat leanúint leis na híocaíochtaí a dhéanamh don chuid eile de théarma an mhorgáiste, is gá duit breithniú a dhéanamh ar cad a d’fhéadfadh athrú i do chás pearsanta agus cibé acu an bhféadfaidh nó nach bhféadfaidh athruithe seachtracha amach anseo do chumas chun aisíocaíocht a dhéanamh

source: While it may be difficult to forecast far into the future, you can assess, for example, what level of interest rate increase you could cope with
ga: Cé go bhféadfadh sé bheith deacair tuar fada amach anseo a dhéanamh, féadfaidh tú measúnú a dhéanamh, mar shampla, ar cén leibhéal de mhéadú ar an ráta úis a bhféadfá glacadh leis

source: Things to consider include:
ga: I measc na rudaí ar cheart duit machnamh a dhéanamh orthu, tá:

source: • Your current and future income
ga: • D’ioncam reatha agus amach anseo

source: • Your current and future expenditure
ga: • Do chaiteachas reatha agus amach anseo

source: • Your age and stage in life
ga: • D’aois agus an chéim sa saol atá bainte amach agat

source: For example, your dependants may need childcare now or may need support going to college in the future
ga: Mar shampla, d’fhéadfadh go mbeadh cúram leanaí ag teastáil ó do leanaí cleithiúnacha anois, nó d’fhéadfadh go dteastódh tacaíocht uathu chun freastal ar an gcoláiste amach anseo

source: • Future interest rates and the future value of your assets
ga: • Rátaí úis amach anseo agus luach do chuid sócmhainní amach anseo

source: • The possibility of inheritances or other lump sums in the future
ga: • An fhéidearthacht i leith oidhreacht nó cnapshuimeanna eile a fháil amach anseo

source: Consumerhelp.ie has a rate change calculator
ga: Tá áireamhán athraithe ráta ar consumerhelp.ie

source: Each lender may offer slightly different alternative repayment arrangements, so this is a general guide
ga: D’fhéadfadh gach iasachtóir socruithe malartacha aisíocaíochta atá beagán difriúil óna chéile a chur ar tairiscint, mar sin, is treoir ghinearálta seo

source: The Central Bank's lending limits on mortgages do not apply to the restructuring of mortgages
ga: Ní bhaineann na teorainneacha nua iasachtaithe ar mhorgáistí a tháinig i bhfeidhm in 2015 le hastruchtúrú morgáistí

source: In general you cannot be asked to change from an existing tracker mortgage to another mortgage type, unless the lender has considered all of the options it offers and has concluded that none of the options that would allow you to keep the tracker interest rate are appropriate and sustainable for your circumstances
ga: Go ginearálta, ní féidir iarraidh ort athrú ó mhorgáiste reatha rianúcháin go dtí morgáiste de shaghas eile, murach gur bhreithnigh an t-iasachtóir gach ceann de na roghanna a chuireann siad ar fáil agus murach go raibh sé ina chonclúid acu nach ligfeadh aon cheann de na roghanna duit an ráta úis rianúcháin a choimeád atá oiriúnach agus inmharthana i dtaobh do chúinsí de

source: If this is the case, your lender may offer you an arrangement that requires you to change from an existing tracker mortgage to another mortgage type
ga: Más amhlaidh an cás, féadfaidh d’iasachtóir socrú a chur ar tairiscint duit a cheanglaíonn ort athrú ó mhorgáiste reatha rianúcháin go dtí morgáiste de shaghas eile

source: Your lender can only do this if the new arrangement is affordable for you and is sustainable over the long term
ga: Ní féidir le d’iasachtóir seo a dhéanamh acu má tá an socrú nua inacmhainne duit agus má tá sé inmharthana san fhadtéarma

source: Some arrangements are short-term – this means that they have a specific duration that will expire at some point in the future – for example a 6-month interest-only arrangement
ga: Bíonn roinnt socruithe gearrthéarmach – ciallaíonn seo go mbíonn téarma sonrach acu a éagfaidh ag tráth éigin amach anseo – mar shampla, socrú úis amháin 6 mhí

source: Others are long-term – for example, extending the term of the mortgage
ga: Bíonn cinn eile fadtéarmach – mar shampla, téarma an mhorgáiste a shíneadh

source: Some lenders may approve a trial arrangement before finalising the proposal
ga: Féadfaidh roinnt iasachtóirí socrú trialach a fhaomhadh sula gcríochnaíonn siad an togra

source: In some cases, the proposal will amend the terms of your original contract, in effect creating a new contract
ga: I roinnt cásanna, leasóidh an togra téarmaí do bhunchonartha, agus cruthófar conradh nua, go héifeachtach

source: In other cases, you may be asked to enter into a completely new contract with your lender
ga: I gcásanna eile, féadtar iarraidh ort conradh úrnua a iontráil le d’iasachtóir

source: │If you are being offered an alternative repayment arrangement under the Mortgage Arrears Resolution Process (MARP) you must always get: │
ga: │Má tá socrú malartach aisíocaíochta á chur ar tairiscint duit faoin bPróiseas Réitigh Riaráistí Morgáiste (PRRM), ní mór duit an méid thíos a fháil i gcónaí: │

source: │ • A clear written explanation of how the alternative repayment arrangement works │
ga: │ • Míniú soiléir scríofa ar conas a oibríonn an socrú malartach aisíocaíochta │

source: │ • The proposed new repayment amount │
ga: │ • Méid na haisíocaíochta nua a bheartaítear │

source: │ • The term of the arrangement │
ga: │ • Téarma an tsocraithe │

source: │ • Information on the impact on the mortgage term, the current balance outstanding and the existing arrears │
ga: │ • Faisnéis ar an tionchar a imrítear ar théarma an mhorgáiste, an t-iarmhéid reatha atá le híoc go fóill agus na riaráistí reatha │

source: │ • How interest will be applied to your mortgage loan account as a result of this arrangement │
ga: │ • Conas a ghearrfar ús ar chuntas d’iasacht mhorgáiste mar thoradh ar an socrú seo │

source: │ • How the arrangement will be reported to the Irish Credit Bureau and the subsequent impact on your credit rating │
ga: │ • Conas a chuirfear an socrú in iúl do Bhiúró Creidmheasa na hÉireann agus an tionchar a imreoidh sé, ina dhiaidh seo, ar do rátáil chreidmheasa │

source: │You must also be told to get independent advice on the proposal
ga: │Ní mór go molfar duit comhairle neamhspleách a fháil faoin togra, chomh maith

source: As part of the Mortgage Arrears Information and Advice Service, your lender will pay €250 for a consultation with an accountant of your choice
ga: Mar chuid den tSeirbhís Bhuiséadta agus Chomhairle Airgid, íocfaidh d’iasachtóir €250 ar chomhairliúchán le do rogha cuntasóra

source: You can find a list of participating accountants on keepingyourhome.ie.│
ga: Féadfaidh tú teacht ar liosta de chuntasóirí rannpháirteacha ar keepingyourhome.ie.│

source: Some examples of alternative repayment arrangements that your lender may offer include the following:
ga: D’fhéadfadh ceann amháin nó níos mó den mhéid a leanas a bheith i gceist leis na socruithe malartacha aisíocaíochta

source: Temporary deferral of payment
ga: Íocaíocht a iarchur go sealadach

source: This is usually a short-term arrangement to ease immediate financial pressure
ga: Is gnách gur socrú gearrthéarmach seo chun brú láithreach airgeadais a mhaolú

source: It is also called a payment break or a moratorium
ga: Tugtar sos íocaíochta nó moratóir air seo chomh maith

source: Move to an interest-only mortgage or change the way you pay interest
ga: Aistriú chuig morgáiste úis amháin nó an bealach a íocann tú ús a athrú

source: This means that you will only pay the interest due on your loan during a certain period, and not the capital amount due
ga: Ciallaíonn seo nach n-íocfaidh tú ach an t-ús atá le híoc ar d’iasacht i rith na tréimhse seo, seachas an méid caipitiúil atá le híoc

source: You may be offered an interest-only option for under or over a year
ga: Féadtar rogha úis amháin a chur ar tairiscint duit ar feadh níos giorra nó níos faide ná bliain amháin

source: In some cases, you may be offered a less than interest-only arrangement for a short period, as interest-only repayments may not be affordable when your situation is assessed
ga: I roinnt cásanna, féadtar socrú níos lú ná an t-ús amháin ar feadh tréimhse ghearr, mar gheall go bhféadfadh nach mbeadh aisíocaíochtaí úis amháin inacmhainne nuair a dhéantar measúnú ar do chás

source: The difference between this lower amount and the interest-only repayment amount may be added on to your outstanding mortgage balance when the alternative repayment arrangement expires
ga: Féadtar an difríocht idir an méid níos ísle seo agus méid na haisíocaíochta úis amháin a shuimiú le hiarmhéid do mhorgáiste nár íocadh as go fóill nuair a éagann an socrú malartach aisíocaíochta

source: You may also be offered a fixed repayment option, where you pay more than just the interest, but less than your full capital and interest repayment, for a fixed period
ga: Anuas air sin, féadtar rogha aisíocaíochta seasta a chur ar tairiscint duit nuair a íocann tú níos mó ná an t-ús amháin ach níos lú ná d’aisíocaíocht iomlán chaipitiúil agus úis ar feadh tréimhse sheasta

source: This means that you pay interest and some capital towards your mortgage
ga: Ciallaíonn seo go n-íocann tú ús agus roinnt caipitil i dtreo do mhorgáiste

source: All of these short-term alternative repayment arrangements are only suitable if you think that you will be able to return to meeting your full capital and interest repayments in the near future
ga: Ní bhíonn gach ceann de na socruithe malartacha aisíocaíochta seo oiriúnach ach má mheasann tú go mbeidh tú in ann filleadh ar d’aisíocaíochtaí iomlána caipitiúla agus úis go gairid amach anseo

source: Some things to consider include:
ga: I measc na rudaí ar cheart duit machnamh a dhéanamh orthu, tá:

source: • When the interest-only period ends, your lender will recalculate your mortgage repayments based on the remaining term and the outstanding mortgage balance
ga: • Nuair a chríochnaíonn an tréimhse úis amháin, athríomhfaidh d’iasachtóir d’aisíocaíochtaí morgáiste bunaithe ar an téarma atá fanta agus ar iarmhéid an mhorgáiste atá le híoc go fóill

source: This means that your repayments will increase, as you now have a shorter term to pay back the outstanding mortgage balance
ga: Ciallaíonn seo go méadófar d’aisíocaíochtaí mar gheall go bhfuil téarma níos giorra agat chun iarmhéid an mhorgáiste atá le híoc go fóill a aisíoc

source: • If you are offered a long term interest-only option, you may need to sell your property to pay the outstanding mortgage balance when the mortgage term expires
ga: • Má chuirtear rogha fhadtéarmach úis amháin ar tairiscint duit, b’fhéidir go mbeidh ort do réadmhaoin a dhíol chun iarmhéid an mhorgáiste atá le híoc a íoc nuair a éagann téarma an mhorgáiste

source: Extending the term of the mortgage
ga: Téarma an mhorgáiste a shíneadh

source: This means that your term is extended, so you pay less each month (because you have spread the repayments over a longer period of time)
ga: Ciallaíonn seo go gcuirtear síneadh ar do théarma ionas go n-íocann tú níos lú gach mí (mar gheall gur leathnaigh tú na haisíocaíochtaí thar thréimhse níos faide ama)

source: It is important to note that your cost of credit will increase, as it will take you longer to clear your mortgage in full
ga: Tá sé tábhachtach go dtugann tú faoi deara go méadóidh do chostas creidmheasa mar gheall go nglacfaidh sé níos faide ort do mhorgáiste a ghlanadh go hiomlán

source: Cost of credit is the difference between the amount that you borrow and the total amount that you will repay, including interest
ga: Is é costas creidmheasa an difríocht idir an tsuim a fhaigheann tú ar iasacht agus an tsuim iomlán a aisíocfaidh tú (ús san áireamh)

source: • What age will you be when the mortgage expires?
ga: • Cén aois a bheidh tú nuair a éagfaidh an morgáiste?

source: • Do you have a compulsory retirement age, or can you continue to work beyond retirement age?
ga: • An bhfuil aois éigeantach scoir agat nó an féidir leat leanúint ag oibriú i ndiaidh na haoise scoir?

source: • If you retire before the mortgage has been paid off, will your pension or other income allow you to continue to pay the mortgage?
ga: • Má théann tú ar scor sular íocadh an morgáiste, an ligfidh do phinsean nó ioncam eile duit leanúint leis an morgáiste a íoc?

source: • Are you clear on the implications of the revised term?
ga: • An dtuigeann tú impleachtaí an téarma leasaithe?

source: While you may be paying less each month, your cost of credit will increase over the extended mortgage term
ga: Cé go bhféadfadh go mbeadh níos lú á íoc agat gach mí, tiocfaidh méadú ar do chostas creidmheasa i gcaitheamh théarma sínte an mhorgáiste

source: Capitalising arrears and interest
ga: Riaráistí agus ús a chaipitliú

source: This alternative repayment arrangement adds the arrears on to the outstanding mortgage balance
ga: Suimíonn an socrú malartach aisíocaíochta na riaráistí le hiarmhéid gan íoc an mhorgáiste agus íoctar iarmhéid méadaithe an mhorgáiste i gcaitheamh théarma an mhorgáiste atá fanta

source: The increased mortgage balance is then paid over the remaining term of the mortgage
ga: D’fhéadfadh seo d’íocaíochtaí míosúla a mhéadú

source: This may increase your monthly payments. This arrangement may be combined with a term extension so that your monthly payments are less
ga: Féadtar an socrú seo a chur i dteannta síneadh téarma ionas go mbíonn d’íocaíochtaí míosúla níos lú

source: If you are not able to service your current mortgage payments, but your circumstances may improve in the future, you may be offered a split mortgage
ga: Murar féidir leat íoc as d’íocaíochtaí reatha morgáiste, ach má d’fhéadfadh feabhas teacht ar do chúinsí amach anseo, d’fhéadfaí morgáiste scoilte a chur ar fáil duit

source: The main aim of a split mortgage is to allow you to stay in your family home
ga: Is é príomhchuspóir morgáiste scoilte a ligean duit fanacht i dteach do theaghlaigh

source: A split mortgage arrangement splits the mortgage into 2 parts
ga: Déanann socrú morgáiste scoilte an morgáiste a scoilteadh ina 2 chuid

source: You make agreed repayments on the first part of the mortgage and the second part is warehoused or set aside to be paid at a later date
ga: Déanann tú aisíocaíochtaí comhaontaithe ar an gcéad chuid den mhorgáiste agus ollstóráiltear nó cuirtear an dara cuid ar leataobh go n-íocfar aisti níos déanaí

source: Some lenders may write off part of the warehoused loan, some add interest to the warehoused part of the mortgage and others do not
ga: Déanfaidh roinnt iasachtóirí cuid den iasacht ollstóráilte a dhíscríobh, roinnt úis a chur leis an gcuid ollstóráilte den mhorgáiste agus ní dhéanfaidh iasachtóirí eile é seo

source: • What percentage of any lump sum you may receive in the future must be paid towards the warehoused loan (for example, if you get an inheritance or a bonus)?
ga: • Cén céatadán d’aon chnapshuim a d’fhéadfá a fháil amach anseo is gá a íoc i dtreo na iasachta ollstóráilte (mar shampla, má fhaigheann tú oidhreacht nó bónas)?

source: • What happens when the loan reaches maturity – do you have to sell the property to repay the outstanding mortgage balance? Or will you keep a right of tenure, where the outstanding debt will only be recovered after your death?
ga: • Cad a tharlaíonn nuair a bhaineann an iasacht aibíocht amach – an gá duit an réadmhaoin a dhíol nó iarmhéid an mhorgáiste atá le híoc go fóill a aisíoc, nó an gcoimeádfaidh tú ceart tionóntachta agus an é nach ndéanfar an fiachas atá le híoc go fóill a aisghabháil ach i ndiaidh do bháis?

source: Reduction in the capital amount
ga: Laghdú ar an méid caipitiúil

source: Your bank may agree to reduce the overall amount outstanding on your mortgage
ga: Féadfaidh do bhanc a chomhaontú chun an méid foriomlán atá le híoc ar do mhorgáiste a laghdú

source: If your lender does not offer you an alternative repayment arrangement, or if you cannot agree on one being offered, you may need to consider other options
ga: Mura bhfuil socrú malartach aisíocaíochta á chur ar tairiscint ag d’iasachtóir, nó murar féidir leat comhaontú ar shocrú atá á chur ar tairiscint, b’fhéidir gur gá duit breithniú a dhéanamh ar roghanna eile

source: Your lender must inform you in writing about the options that are available to you. These may include voluntary surrender, trading down, mortgage-to-rent or voluntary sale
ga: Ní mór do d’iasachtóir thú a chur ar an eolas i scríbhinn faoi na roghanna atá ar fáil duit, ina measc, d’fhéadfaí géilleadh deonach, trádáil anuas, cíos in ionad morgáiste nó díol deonach a áireamh leo seo

source: You must be informed of the implications of each option and what will happen to any outstanding debt
ga: Ní mór thú a chur ar an eolas ar impleachtaí gach rogha agus ar cad a tharlóidh d’aon fhiachas atá le híoc go fóill

source: • Voluntary surrender of the property
ga: • Géilleadh deonach na réadmhaoine

source: You surrender the property to your lender
ga: Tugann tú an réadmhaoin suas do d’iasachtóir

source: If there is a shortfall (the property sells for less than the outstanding mortgage balance) you remain liable for this and you will need to agree a repayment arrangement with your lender to deal with the shortfall
ga: Má tá easnamh ann (díoltar an réadmhaoin ar shuim atá níos lú ná iarmhéid an mhorgáiste atá le híoc go fóill) beidh tú fós faoi dhliteanas íoc as seo agus beidh ort comhaontú a dhéanamh ar shocrú aisíocaíochta le d’iasachtóir chun déileáil leis an easnamh

source: You may be able to sell your property and buy a new property of a lower value
ga: B’fhéidir go mbeidh tú in ann do réadmhaoin a dhíol agus réadmhaoin nua ar luach níos ísle a cheannach

source: It may be possible to add negative equity to the loan and secure it on the new property
ga: D’fhéadfaí cothromas diúltach a chur leis an iasacht agus í a fháil ar an réadmhaoin nua
